// ***********************************************************************
// 作者           : 阿尔卑斯 shuaihong617@qq.com
// 创建           : 2017-01-19
//
// 编辑           : 阿尔卑斯 shuaihong617@qq.com
// 日期           : 2017-01-19
// 内容           : 创建文件
// ***********************************************************************
// Copyright (c) 果壳机动----有金属的地方就有果壳. All rights reserved.
// <summary>
// </summary>
// ***********************************************************************


namespace Nutshell.Speech
{
	/// <summary>
	/// 语音合成器状态枚举
	/// </summary>
	public enum SynthesizerState
	{
		/// <summary>
		/// 空闲
		/// </summary>
		空闲,
		/// <summary>
		/// 合成
		/// </summary>
		合成
	}
}
