// ***********************************************************************

// 作者           : 阿尔卑斯 shuaihong617@qq.com
// 创建           : 2014-10-24
//
// 编辑           : 阿尔卑斯 shuaihong617@qq.com
// 日期           : 2014-10-24
// 内容           : 创建文件
// ***********************************************************************
// Copyright (c) 果壳机动----有金属的地方就有果壳. All rights reserved.
// <summary>
// </summary>
// ***********************************************************************

namespace Nutshell
{
        /// <summary>
        ///         方向枚举
        /// </summary>
        public enum Language
        {
                /// <summary>
                ///         未知
                /// </summary>
                未定义 = 0,

                /// <summary>
                ///         上
                /// </summary>
                中文 = 1,

                /// <summary>
                ///         下
                /// </summary>
                英文 = 2,
        }
}