// ***********************************************************************
// 作者           : 阿尔卑斯 shuaihong617@qq.com
// 创建           : 2017-06-06
//
// 编辑           : 阿尔卑斯 shuaihong617@qq.com
// 日期           : 2017-06-06
// 内容           : 创建文件
// ***********************************************************************
// Copyright (c) 果壳机动----有金属的地方就有果壳. All rights reserved.
// <summary>
// </summary>
// ***********************************************************************
namespace Nutshell.SerialPorts
{
        /// <summary>
        /// 串口通讯波特率枚举
        /// </summary>
        public enum BaudRate
        {
                /// <summary>
                /// 9600
                /// </summary>
                Baud9600 = 9600
        }
}
