// ***********************************************************************
// 作者           : 阿尔卑斯 shuaihong617@qq.com
// 创建           : 2014-10-24
//
// 编辑           : 阿尔卑斯 shuaihong617@qq.com
// 日期           : 2014-10-24
// 内容           : 创建文件
// ***********************************************************************
// Copyright (c) 果壳机动----有金属的地方就有果壳. All rights reserved.
// <summary>
// </summary>
// ***********************************************************************

namespace Nutshell.RabbitMQ.SDK
{
        /// <summary>
        ///         交换机类型枚举
        /// </summary>
        public enum ExchangeType
        {
                Direct,

                Fanout,

                Topic,
        }
}