// ***********************************************************************
// 作者           : 阿尔卑斯 shuaihong617@qq.com
// 创建           : 2016-10-28
//
// 编辑           : 阿尔卑斯 shuaihong617@qq.com
// 日期           : 2016-10-07
// 内容           : 创建文件
// ***********************************************************************
// Copyright (c) 果壳机动----有金属的地方就有果壳. All rights reserved.
// <summary>
// </summary>
// ***********************************************************************

namespace Nutshell.Fyying.SDK
{
        /// <summary>
        /// 摄像机名称枚举
        /// </summary>
        public enum ErrorCode
        {
                失败 = -1,
		成功 = 0,
        }
}